src/cf/src/InformationRegisters/ТелеграмЖурнал/ТелеграмЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмЖурнал</name>
  <resources>
    <name>СтрокаJSON</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Бот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ТелеграмЖурнал/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(Бот, СтрокаJSON, Метод, Тип = Неопределено) Экспорт
	
	Если СтрокаJSON = "{""ok"":true,""result"":[]}" Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Бот) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ФорматированныйJSON = ТелеграмСервер.ФорматироватьСтрокуJSON(СтрокаJSON);
	Исключение
		ФорматированныйJSON = СтрокаJSON;
	КонецПопытки;
	
	МенеджерЗаписи = РегистрыСведений.ТелеграмЖурнал.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Бот = Бот;
	МенеджерЗаписи.ДатаВремя = ТекущаяДата();
	МенеджерЗаписи.УникальныйИдентификатор = Новый УникальныйИдентификатор;
	МенеджерЗаписи.СтрокаJSON = ФорматированныйJSON;
	МенеджерЗаписи.Метод = Метод;
	МенеджерЗаписи.Тип = ?(Тип = Неопределено, ОпределитьТип(Метод), Тип);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьТип(Метод)
	
	Если Метод = "getUpdates" Тогда
		Возврат "ВХ";
	Иначе
		Возврат "ОТВЕТ";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
